Autodesk.Revit.DB.ParameterAccess.GetParameter(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Retrieves the parameter value for the parameter belonging to the parameter document on the given element.
elementId:
Autodesk.Revit.DB.LinkElementId of the element whose parameter value is requested.
parameterDoc:
The document which contains the parameter.
parameterId:
The id of the parameter to obtain.
Returns:
The evaluated parameter value or a default object if no value exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ParameterAccess.GetParameter(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Retrieves the parameter value for the parameter on the given element.
elementId:
Autodesk.Revit.DB.ElementId of the element whose parameter value is requested.
parameterId:
The id of the parameter to obtain.
Returns:
The evaluated parameter value or a default object if no value exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ParameterAccess.ListParameters(Autodesk.Revit.DB.LinkElementId)
Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
id:
Autodesk.Revit.DB.LinkElementId of the element whose parameters should be listed.
Returns:
The ids of parameters applicable to the element, collected by the Autodesk.Revit.DB.Document where the
Autodesk.Revit.DB.Definition of those parameters are stored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ParameterAccess.ListParameters(Autodesk.Revit.DB.ElementId)
Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
id:
Autodesk.Revit.DB.ElementId of the element whose parameters should be listed.
Returns:
The ids of parameters applicable to the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ParameterAccess.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ParameterAccess.#ctor(Autodesk.Revit.DB.Document)
Constructs a new ParameterAccess object bound to the given host document.
doc:
The document that will be used to identify elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ParameterAccess
Provides a common mechanism to access parameters, including extended properties.
Since:
2027